app/Http/Controllers/Api/BalanceController.php

    public function index(Request $request)
    {
        $data = array();
        $limit = $request->per_page ? $request->per_page : 25;
        $page = $request->page ? $request->page : 1;
        $sort_field = $request->sort_field ? $request->sort_field : 'id';
        $sort_order = $request->sort_order ? $request->sort_order : 'desc';

        $balance = Balance::first();
---
SELECT * FROM `balances` LIMIT 1