app/Http/Controllers/Api/EntityController.php

    public function compose_list(Request $request)
    {
        $entities = DB::table('data_types')
            ->select(['id', 'title_singular', 'title_plural', 'enable'])
            ->where('hidden', 0)
            ->get();

        // Используем коллекции для трансформации данных
        $list = $entities->map(function ($entity) {
            return [
                'id' => $entity->id,
                'name' => $entity->title_plural,
                'enable' => $entity->enable
            ];
        });
---
SELECT `id`, `title_singular`, `title_plural`, `enable` FROM `data_types`