app/Http/Controllers/Api/ModuleController.php

    public function list(Request $request, $slug = null)
    {
        if(!$slug) {
            $modules = Module::all();
---
SELECT * FROM `modules`

            return ($a['name'] < $b['name']) ? -1 : 1;
        });

        $data = array(
            'categories' => ModuleCategory::all(),
            'modules' => $data
        );
---
SELECT * FROM `module_categories`