app/Http/Controllers/Api/ObjectController.php

SELECT * FROM `data_types` WHERE `slug` = 'companies' LIMIT 1
---
    public function compose_list($slug, Request $request)
    {
        $profile = \Auth::user();
        $data_type_id = \DB::table('data_types')->where('slug', $slug)->first()->id;

SELECT `slug`, `title_singular`, `title_plural`, `color` FROM `data_types`
---
        //api/fields/$slug
        $fields = \App\Models\Field::list($slug);
        //api/entities
        $entities = \DB::table('data_types')->select(['slug', 'title_singular', 'title_plural', 'color'])->get();