app/Http/Controllers/Api/ProfileController.php

    public function show()
    {
        $user = \Auth::user();

        $now = Carbon::now();
        if(\DB::table('local_cache')->where(['url' => 'profile', 'user_id' => $user->id])->exists())
            \DB::table('local_cache')->where(['url' => 'profile', 'user_id' => $user->id])->update(['updated_at' => $now]);
        else
            \DB::table('local_cache')->insert(['url' => 'profile', 'user_id' => $user->id, 'created_at' => $now, 'updated_at' => $now]);

        //cache()->flush();
        $user->is_admin = $user->isAdmin();
        $name = json_decode($user->name, true);
        if(is_array($name) && array_key_exists('value', $name))
            $user->name = $name['value'];

        $last_name = json_decode($user->last_name, true);

        if(is_array($last_name) && array_key_exists('value', $last_name))
            $user->last_name = $last_name['value'];

        if(!$user->name && !$user->last_name)
            $user->name = $user->id;

        $balance = Balance::select('sum')->first();
---
SELECT exists(SELECT * FROM `local_cache` WHERE (`url` = 'profile' and `user_id` = 1)) as `exists`
UPDATE `local_cache` SET `updated_at` = '2024-08-05 16:29:23' WHERE (`url` = 'profile' and `user_id` = 1)
SELECT `sum` FROM `balances` LIMIT 1