app/Http/Controllers/Api/RequisiteController.php

SELECT * FROM `requisites` WHERE `company_id` IS NULL and `requisites`.`deleted_at` IS NULL
---
    public function list(Request $request, $company_id = null)
    {
        $items = Requisite::where('company_id', $company_id)->get();