app/Http/Controllers/Api/RoleController.php

SELECT * FROM `roles` WHERE `roles`.`id` = '1' LIMIT 1
SELECT * FROM `permissions` WHERE `entity_id` IS not NULL and `role_id` = '1'
---
    public function show($id, Request $request)
    {
        if(!\Auth::user()->is_admin)
            return response()->json([
                'message' => 'Доступ ограничен'
            ], 403);
        $role = Role::find($id);
        $data_types = \DB::table('data_types')->where('enable', 1)->where('hidden', 0)->get()->keyBy('id')->toArray();
        //$permissions = $role->permissions_tables();
        $permissions = array();
        $res = \App\Models\Permission::whereNotNull('entity_id')->where('role_id', $id)->get()->keyBy('entity_id')->toArray();