app/Http/Controllers/Api/SettingsController.php

SELECT * FROM `settings` WHERE (`type` = 'account')
---
    public function account(Request $request)
    {
        $tenant = tenant('id');
        $settings = \DB::table('settings')->where([
            'type' => 'account'
        ])->get();