app/Models/Field.php

    public static function list($slug)
    {
        $settings = app('settings');

        $entity = $settings['models'][$slug];
        $entity_class = $entity->model_name;
        $model_fields = $settings[$slug]['fields'];//$entity_class::getFields();

        $users = \App\Models\User::get(['id', 'name', 'last_name'])->keyBy('id')->toArray();
---
SELECT `id`, `name`, `last_name` FROM `users` WHERE `users`.`deleted_at` IS NULL