app/Models/Menu.php

SELECT * FROM `settings` WHERE (`entity` = 'companies' and `type` = 'tabs') LIMIT 1
---
    public static function tabs($slug)
    {
        $user = \Auth::user() ? \Auth::user() : \App\Models\User::find(1);
        $menu = array();
        $item = \DB::table('settings')->where([
            'entity' => $slug,
            'type' => 'tabs',
            'user_id' => $user->id
        ])->first();