app/Models/Role.php

    public static function list()
    {
        $data = array();

        $items = Role::orderBy('display_name', 'asc')->get();
---
SELECT * FROM `roles` ORDER BY `display_name` ASC