app/Models/Tariff.php

SELECT * FROM `settings` WHERE (`key` = 'tariff') LIMIT 1
SELECT * FROM `tariffs` WHERE `tariffs`.`id` = '4' LIMIT 1
---
    public static function set($id)
    {
        $tariff = Tariff::where('id', $id)->firstOrFail();

        \DB::table('settings')->where([
            'key' => 'tariff'
        ])->update([
            'value' => $tariff->id//json_encode(['id' => $tariff->id])
        ]);

        $tenant = tenant('id');

        tenancy()->central(function () use ($tariff, $tenant) {
            $crudService = new CrudService;

            $account = Account::where('tenant_id', $tenant)->first();


            $data = [
                'id' => $account->id,
                'tariff' => $tariff->name
            ];
            $result = $crudService->batch('accounts', [$data]);
        });